function run(N) {
    console.log(`N`, N);

    //заполняем массив N*N нулями
    const boardArr = new Array(N)
    for (let i = 0; i < N; i++) {
        boardArr[i] = new Array(N).fill(0)
    }

    //делаем изначальные пути пешки, до вертикали и горизонтали. ставим 1
    for (let i = 1; i < N; i++) {
        boardArr[N - 1][i] = 1
        boardArr[N - 1 - i][0] = 1
    }
    // [
    //     [1, 0, 0, 0, 0],
    //     [1, 0, 0, 0, 0],
    //     [1, 0, 0, 0, 0],
    //     [1, 0, 0, 0, 0],
    //     [0, 1, 1, 1, 1]
    // ]
    //частный случай что пушка может ходить по диагонали
    boardArr[N - 2][1] = 1
    //итоговый массив 
    // [
    //     [1, 0, 0, 0, 0],
    //     [1, 0, 0, 0, 0],
    //     [1, 0, 0, 0, 0],
    //     [1, 1, 0, 0, 0],
    //     [0, 1, 1, 1, 1]
    // ]
    for (let y = N - 2; y >= 0; y--) {//начинаем с левого нижнего угла
        for (let x = 1; x < N; x++) {
            boardArr[y][x] += boardArr[y + 1][x] + boardArr[y][x - 1] + boardArr[y + 1][x - 1]//суммируем коллиечство путей по массиву
        }
        //после первого прохода цикла, суммираем предыдущие ходы, по итого в крайней верхней точке будет итоговое коллиество путей
        // [
        //     [1, 0, 0, 0, 0],
        //     [1, 0, 0, 0, 0],
        //     [1, 0, 0, 0, 0],
        //     [1, 3, 5, 7, 9],
        //     [0, 1, 1, 1, 1]
        // ]
    }
    // console.log(`boardArr`, boardArr);
    console.log(`Answer: `, boardArr[0][N - 1]);
}

const n = 5;
run(n);